## 주요 개념 정리



## 💡 학습하면서 느낀 점




## ❓ 질문 및 궁금한 점






"""
# enumerate 

#인덱스 값을 포함한 값을 반환한다.

#객체의 값이 어디있는지 알아볼 수 있다.

for i, name in enumerate (['body', 'foo', 'bar'])

print(i,name)

0 bidy

1 foo

2 bar



"""





"""
#eval

eval('1+2')

3

eval('hi+a')

hia

eval('divmod(4,3)')

(1,1): 몫, 나머지

#편리하지만 속도 비용 보안상으로 지양해야할 함수

"""




"""
#filter

def positive(I):
    if I > 0: #  값 비교
        return I

result = [] #값을 넣을 리스트 생성

for i in I: #리스트 안의 값을 i에 넣고

    if i>0: #0보다 크다면

        result.append(I) #result에 추가

print(positive([1,-3,2,0,-5,6]))

#실행결과: 1,2,6 #양수만 골라서 출력

"""
# 값 비교 ,값을 넣을 배열 생성, 



"""

def positive(x):

    return x>0 #x값이 0보다 크면 반환

#True나 false로 반환 될 것 같았지만 값이 반환되는 듯


print(list(filter(positive, [1,-3,2,0,-5,6])))

#리스트로 형변환 filter 함수안에 반복가능한 데이터를 처리할 함수


"""




"""
print(list(lambda( x: x>0,[1,-3,2,0,-5,6])))

#리스트 형 변환 람다(변수: 조건문, 확인할 배열)

"""



"""
#10진수를 받아 16진수로 변환

hex(234) => Oxea 16*14 + 10

"""





"""

### id ###

#객체를 입력받아 고유 주소값을 반환

a = 3

id(3)

id(a)

b=a

id(b)

출력: 같은 주소값 = 같은 객체를 가르키고 있음

"""





"""
### a = input() # 입력 hi ###

print(a) # hi

b = input("Enter:") #Enter: => #hi 입력

#우선 출력

print(b)

#Enter:hi

"""




"""

### int ###

int('3') = > 문자 3이 정수 3으로 변환

int('11',2) = > 뒤에 있는 숫자 2는 이진수를 뜻함

int('1A',16) > 마찬가지로 16진수 16+10 = 26


"""



"""
### isinstance ###


#입력한 객체가 해당 클래스의 인스턴스인지 판별하는 함수

class Person:

pass

a = Person()

isinstance(a, Person()) # True

"""



"""
### len ###

입력값의 길이를 숫자로 변환

"""


"""

### list ###

반복가능한 데이터를 입력 받아 리스트로 변환

list((1,2,3))

['1','2','3']

a =[1,2,3]

b=list(a)

print(b)

[1,2,3] # 리스트를 리스트로 형 변환하면 리스트 그대로 출력


"""


"""

def two_tirnes(numberList):

result=[] # 배열 생성

for number in numberList: # numberList에 저장되어 있는 값을

#number에 저장

result.append(number*2)

#생성된 result 배열에다 number에 저장된 값 *2를 하여 저장

return result # for 구문이 완료 되면 해당 값을 리턴

result = two_times([1,2,3,4]) # 함수 two_times에 전달할 값

print(result)





# map 함수를 사용하는 경우

def two_times(x):

return x*2

list(map(two_times,[1,2,3,4]))  #list로 형 변환 (함수, 값)를 넣고 출력

#배열을 생성하지 않아도 알아서 배열생성 및 추가

# map 함수에 람다(lambda)

list(map(lambda x: x*2,[1,2,3,4]))

#람다를 사용하면 함수를 만들지 않고도 한줄로 해결

"""



"""
### max, min ###

#배열이나 문자열 형태를 max 함수에 입력하면 가장 높은값을 출력해줌

max([1,2,3]) => 3

min([1,2,3]) = > 1 #min은 반대


"""




"""### range, round ###

range(초기값, 종료값 -1, 증가값)

round(반올림 할 값,뒤 몇번째까지 출력)
"""



"""
### sorted ###

#입력한 값을 오름차순으로 정리하여 출력

sorted([3,1,2]) = > [1,2,3]
"""


"""
### str,pow,sum ###

str = > 문자형으로 형 변환 함수

pow => (숫자, 제곱)

sum ([1,2,3])"""