## 주요 개념 정리



## 💡 학습하면서 느낀 점


"""


"""

## ❓ 질문 및 궁금한 점



# 함수 생성
"""
def gugu(n): # gugu 함수 생성
    
    print(n)
    
    
result = gugu(2)




def gugu(n):
    result = []
    
    for i in range(1,10,1):
        result.append(n*i)
        
    return result



print(gugu(2))"""




""" 10미만의자연수에서 3과 5의 배수를 구하면 3,5,6,9, 

이들의 총합은 23이다.

1000미만의 자연수에서 3의 배수와 5의 배수의 총합을 구하라 """

"""
# 조건 3 또는 5로 나뒤는 수

a = []

for i in range(1,1001,1):
    
    if i%3 ==0 or i%5 == 0:
        a.append(i)
        
    else:
        continue
    
b = tuple(a)

print(b) 
        """
        
        
        
        
        
    